import os

#######马斯京根模型参数#######

k = [0, 0, 0, 0, 13, 16, 16, 80, 150]

x = [0, 0, 0, 0, 0, 0, 0, 0, 0.2]

t = [24, 24, 24, 24, 24, 24, 24, 24, 24]

#损失流量与上游流量经验方程系数（二元一次方程）

cost_cofficient_list = [[2e-06, 4e-07, 7e-07, 1e-06, 5e-05, 9e-05, 5e-07, 0, -0.0256],
                        [0.0051, 0.0257, 0.0607, 0.0262, -0.0022, -0.0044, -0.0002, -1e-04, 1.2622],
                        [0.1383, 0.1532, 0.1517, 0.5247, 1.026, 0.2016, 0.3134, 0.1667, -4.191]]

#河道水面面积与上游流量经验方程系数（二元一次方程）

surface_cofficient_list = [[-0.0025, -0.0029, -0.0006, -0.0064, -0.0046, -0.003, -7e-05, -0.0012, -0.1226],
                           [0.7429, 0.983, 0.2342, 1.6813, 1.0961, 0.9248, 0.02, 0.2796, 33.107],
                           [48.48, 36.206, 39.956, 62.855, 68.038, 224.92, 85.033, 39.779, 770.2]]

#河道砂石坑、湖泊等蓄水水量
# calculation_river_special_lose_water = [0, 0, 0, 0, 0, 0, 0, 0, 0]
calculation_river_special_lose_water = [0, 0, 0, 0, 0, 0, 6500000, 0, 850000]

#河道初始流量

or_q_list = [0, 0, 0, 0, 0, 0, 0, 0, 0]

#各分水口分水数据（时序数据）文件路径
PROJECT_ROOT = os.path.dirname(os.path.abspath(__file__))
DATA_DIR = os.path.join(PROJECT_ROOT, 'data')
excel_path = os.path.join(DATA_DIR, 'water_divide.xlsx')


#######SM模型参数#######

# 总的调度水量
w_total = 150000000
# 调度流量边界
min_q = 3
max_q = 100
# 每次次生成调度方案个数
dim = 100
# 调度方案天数
m = 80
# 外循环最大迭代次数
max_p_out =5
# 内循环最大迭代次数
max_p = 5
#模型最大更新速度
velocity_max=5
#模型最大更新速度
velocity_min=-5


#######SM模型输出结果#######
SM_save_file = os.path.join(DATA_DIR, 'SM_model_result.json')


#######决策者主观权重#######
wz=[0.25,0.25,0.25,0.25]


#######方案排序结果#######
DO_save_file=os.path.join(DATA_DIR, 'DO_g_result.json')